# Pandas: Core Functionality

Pandas is an open source Python library for data analysis. It gives Python the ability to work with spreadsheet-like data for fast data loading, manipulation, aligning, and merging, among other functions.

To give Python these enhinaced features, Pandas introduces two new data types to Python: ``Series`` and ``Data Frame``.

So, let's discuss both the types:

In [2]:
# Import pandas and numpy library
import pandas as pd
import numpy as np

If article reading is your thing,ten I have also written an article on the same topic link is here:

## What is a Series?

+ It is the building block of pandas
+ Ordered key-value pairs with homogeneous data type
+ A data array and a label array

### Ordered key-value pairs with homogenous data type

<a href="https://imgbb.com/"><img src="https://i.ibb.co/Z2Yh3ZT/Blank-Diagram-1.png" alt="Blank-Diagram-1" border="0"></a>

### A label array and a data array

<a href="https://imgbb.com/"><img src="https://i.ibb.co/tYN5dN6/Blank-Diagram-2.png" alt="Blank-Diagram-2" border="0"></a>

In [3]:
# Create a simple Series
s = pd.Series([2,4,6,8])
s

0    2
1    4
2    6
3    8
dtype: int64

In [4]:
# Convert to another numpy dtype
s.astype(np.float64)

0    2.0
1    4.0
2    6.0
3    8.0
dtype: float64

Now, the dtype has been changed to float64.

## Series from a pandas perspective

In pandas:
   + The keys/labels are called the index
   + The data are the values

**Note**: The ``index`` is not required to be unique but some operations are not supported if there are duplicates, e.g., unstacking

## Series - Implicit Index

In [4]:
s = pd.Series([1,2,3,4])
s.index

RangeIndex(start=0, stop=4, step=1)

If you don't provide explicit labels you get increasing integer labels.

In [5]:
s.array

<PandasArray>
[1, 2, 3, 4]
Length: 4, dtype: int64

``s.array`` is a numpy compatible array

## Series - Explicit Index

In [25]:
s1 = pd.Series([1,2,3,4], index=['a','b','c','d'])
print(s1)

s1.index # explicit index

a    1
b    2
c    3
d    4
dtype: int64

Index(['a', 'b', 'c', 'd'], dtype='object')

Now we have a new kind of ``Index``, but the values stay the same.

In [10]:
s1.array  # pandas > 0.24.0

<PandasArray>
[1, 2, 3, 4]
Length: 4, dtype: int64

## Series from dict

We can create series from a dict.

``dict``s preserve insertion order since Python 3.6 so you can no longer rely on pandas automatically sorting the index

In [3]:
s2 = pd.Series({'a':1, 'b':2, 'd':4, 'c':3})
s2

a    1
b    2
d    4
c    3
dtype: int64

## Selecting from a Series

+ Select by position: ``iloc``
+ Select by label: ``loc``
+ Let pandas decide if label or position

### Selection by position

In [4]:
print(s2)

s2.iloc[0] # by position

a    1
b    2
d    4
c    3
dtype: int64

1

In [5]:
# shortcut method
print( s2[0] )

# more example
s2[0] , s2[1], s2[2], s2[3]

1

(1, 2, 4, 3)

### Selection by label

In [6]:
print(s2)

s2.loc['a'] # by label

a    1
b    2
d    4
c    3
dtype: int64

1

In [7]:
# shortcut method
print( s2['a'] )

# more example
s2['a'], s2['d'], s2['b']

1

(1, 4, 2)

In [8]:
s2

a    1
b    2
d    4
c    3
dtype: int64

In [9]:
s2[['a', 'b']  # slices

a    1
b    2
dtype: int64

In [10]:
s2[[0, 1]]  #same

a    1
b    2
dtype: int64

## Filtering

All operations are vectorized over the Series

In [16]:
fltr = s2 > 2
print(fltr)

# Selecting with a boolean vector
s2[fltr]

a    False
b    False
d     True
c     True
dtype: bool

d    4
c    3
dtype: int64

In [17]:
## Filtering with compound statements
fltr = (2 < s2) & (s2 < 4)
print(fltr)

s2[fltr]

a    False
b    False
d    False
c     True
dtype: bool

c    3
dtype: int64

``&`` binds more tightly than comparison operators so you need parentheses

## Filtering - Missing Data

In [18]:
s3 = pd.Series([1, 2, np.nan, 4], dtype='Int64')
print(s3)

s3.isnull() # method

0       1
1       2
2    <NA>
3       4
dtype: Int64

0    False
1    False
2     True
3    False
dtype: bool

In [28]:
s3[pd.notnull(s3)] # function

0    1
1    2
3    4
dtype: Int64

**Note**: labels (index) preserved

In [19]:
## Types of Missing Data
s4 = pd.Series([1, 2, 3, np.nan, 5], index=list('abcde'))
s4

a    1.0
b    2.0
c    3.0
d    NaN
e    5.0
dtype: float64

**Note**: The data type of ``s4`` is ``float64`` because there is **no integer ``NA``** in pandas < 0.24.0

## Alignment

Operations in pandas are implicimtly aligned by index!

In [20]:
s1 = pd.Series([1, 2, 3], index=list('abc'))
s2 = pd.Series([4, 5, 6, 7], index=list('abcd'))

s1 + s2

a    5.0
b    7.0
c    9.0
d    NaN
dtype: float64

We can see that at index ``d`` we're getting ``NaN`` beacuse by default it performs an ``outer join``, filling missing levels with ``NaN``s

xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx ``END OF PANDAS SERIES`` xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxm

# Data Frames

+ The workhorse of pandas
+ Similar to a table in SQL or a list of named records
+ Named after ``data.frame`` in the R language, from which it was inspired

## Creating a DataFrame

Several ways to create
a DataFrame

+ From a dict to lists
+ From a list of dicts
+ From another DataFrame

In [37]:
# From a dict of lists
df = pd.DataFrame({
    'name': ['Sushil', 'Sudip', 'Aakansha', 'Amit', 'Harsh'],
    'region': ['East', 'West', 'North', 'South', 'East'],
    'sales': [50000, 52000, 90000, 34000, 42000]
})
df

       name region  sales
0    Sushil   East  50000
1     Sudip   West  52000
2  Aakansha  North  90000
3      Amit  South  34000
4     Harsh   East  42000

In [38]:
# From a list of dicts
pd.DataFrame([
    {'name': 'Sushil', 'region': 'East', 'sales': 50000 },
    {'name': 'Sudip', 'region': 'West', 'sales': 52000 },
    {'name': 'Aakansha', 'region': 'North', 'sales': 90000 }
])

       name region  sales
0    Sushil   East  50000
1     Sudip   West  52000
2  Aakansha  North  90000

In [39]:
# From another dataframe
pd.DataFrame(df, columns=['name', 'region', 'sales', 'expenses'])

       name region  sales  expenses
0    Sushil   East  50000       NaN
1     Sudip   West  52000       NaN
2  Aakansha  North  90000       NaN
3      Amit  South  34000       NaN
4     Harsh   East  42000       NaN

Notice that the ``expenses`` columns is all ``NaN``

## Single Axis Selection - Columns

Use:
+ dict style lookup, e.g., ``df['col']``
+ attribute lookup, e.g., ``df.col``

Filter either rows or columns, but not both. (unless you pass a DataFrame to select individual cells)

Attribute and scalar indexing of columns returns a ``Series``, NOT a DataFrame

### Attribute Lookup

Attribute access based on column names. Only works for valid attribute names (no spaces, keywords)

In [41]:
df.name

0      Sushil
1       Sudip
2    Aakansha
3        Amit
4       Harsh
Name: name, dtype: object

## dict lookup

Dictionary-style ``(__getitem__)`` lookup is more flexible, supports names that aren't valid attributes

In [43]:
df['first-name'] = df['name']
df['first-name']

0      Sushil
1       Sudip
2    Aakansha
3        Amit
4       Harsh
Name: first-name, dtype: object

## Multiple Columns

If you want to retireve a single or multi-column DataFrame or multiple you must pass a ``list``.

In [44]:
df[['name', 'sales']]

       name  sales
0    Sushil  50000
1     Sudip  52000
2  Aakansha  90000
3      Amit  34000
4     Harsh  42000

## Single Axis Selection - Rows

Works similarly to Series logical indexing

In [45]:
idx = [True, True, False, True, True]
df[idx]

     name region  sales first-name
0  Sushil   East  50000     Sushil
1   Sudip   West  52000      Sudip
3    Amit  South  34000       Amit
4   Harsh   East  42000      Harsh

## Single Axis Selection Summary

When the index is:
   + ``list[bool]`` operates on rows
   + ``str`` or ``list[str]`` operates on columns
   + slices then operates on the columns
   + DataFrame operates celll-by-cell

## Multi-Axis Selection

The most common situation is logical indexing on the rows and label indexing on the columns using ``loc``

In [46]:
idx = [True, True, False, True, True]
df.loc[idx, ['name', 'sales']]

     name  sales
0  Sushil  50000
1   Sudip  52000
3    Amit  34000
4   Harsh  42000

## Add an Index

May select by label on both rows and columns.

We haven't set an index on ``df`` so it has the default integer index.

In [47]:
df

       name region  sales first-name
0    Sushil   East  50000     Sushil
1     Sudip   West  52000      Sudip
2  Aakansha  North  90000   Aakansha
3      Amit  South  34000       Amit
4     Harsh   East  42000      Harsh

In [48]:
# Note that `df1` is a copy of `df`
df1 = df.set_index('name')

# -------------------------- COMING SOON PART 2 ----------------------------------------------

## Select by row index

# Split, Apply, Combine
by Hadley Wickham

**The split-apply-combine strategy for data analysis** <br/>
Journal of Statistical Software, col.40, no. 1, pp. 1-29, 2011

<a href="https://ibb.co/9npKJPW"><img src="https://i.ibb.co/wydGTt4/Split.png" alt="Split" border="0"></a>

In [3]:
df = pd.DataFrame({
    "name": ['SUSHIL', 'AMIT', 'SUDIP', 'SUSHIL', 'AMIT', 'SUDIP'],
    "sales": [565.8, 900.4, 450.7, 800.0, 657.7, 450.0]
})
df

     name  sales
0  SUSHIL  565.8
1    AMIT  900.4
2   SUDIP  450.7
3  SUSHIL  800.0
4    AMIT  657.7
5   SUDIP  450.0

In [22]:
grp = df.groupby('name')

for name, sales in grp:
    print(f'Name : {name}')

sales

Name : AMIT
Name : SUDIP
Name : SUSHIL

     name  sales
0  SUSHIL  565.8
3  SUSHIL  800.0

## Apply
Deafult applies to all numeric columns

In [21]:
grp.mean()

         sales
name
AMIT    779.05
SUDIP   450.35
SUSHIL  682.90

## Single column apply
Apply to a single column

In [24]:
df1 = pd.DataFrame({
    "name": ['SUSHIL', 'AMIT', 'SUDIP', 'SUSHIL', 'AMIT', 'SUDIP'],
    "sales": [565.8, 900.4, 450.7, 800.0, 657.7, 450.0],
    "expenses": [450.9, 600.0, 600.8, 500.7, 435.7, 509.5]
})
df1

     name  sales  expenses
0  SUSHIL  565.8     450.9
1    AMIT  900.4     600.0
2   SUDIP  450.7     600.8
3  SUSHIL  800.0     500.7
4    AMIT  657.7     435.7
5   SUDIP  450.0     509.5

# ---------------------------------------- COMING SOON PART 3 -----------------------------------